In [1]:
 import pandas as pd
    
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [2]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [3]:
# Get info on unique values
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [4]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [5]:
# Get number of unique values
df_one.nunique()

k1      3
col1    5
col2    5
dtype: int64

In [6]:
# Per col
df_one['k1'].nunique()

3

In [7]:
# Count unique entries
df_one['col2'].value_counts()

WA    2
CA    1
NY    1
NV    1
AK    1
Name: col2, dtype: int64

In [8]:
# Drop duplicates
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [9]:
# Create new cols with ops and funcs
df_one['NEW'] = df_one['col1'] * 10

In [10]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [11]:
def grab_first_letter(state):
    return state[0]

In [12]:
grab_first_letter('NY')

'N'

In [13]:
df_one['First Letter'] = df_one['col2'].apply(grab_first_letter)

In [14]:
df_one

  k1  col1 col2   NEW First Letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [15]:
def complex_letters(state):
    if state[0] == 'W':
        return "Washington"
    else:
        return "Error"

In [16]:
df_one['col2'].apply(complex_letters)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [17]:
# Mapping
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [18]:
my_map = {'A':1, 'B':2, 'C':3}

In [19]:
df_one['num'] = df_one['k1'].map(my_map)

In [20]:
df_one

  k1  col1 col2   NEW First Letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [21]:
df_one['col1'].max()

500

In [22]:
# Get location of max
df_one['col1'].idxmax()

5

In [23]:
# For min
df_one['col1'].idxmin()

0

In [24]:
# Grab all cols
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW', 'First Letter', 'num'], dtype='object')

In [25]:
# Reassign (is permanent )
df_one.columns = ['C1', 'c2', 'c3', 'c4', 'c5', 'c6']

In [26]:
df_one

  C1   c2  c3    c4 c5  c6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [27]:
# Sort values by certain col
df_one.sort_values('c3', ascending=False)

  C1   c2  c3    c4 c5  c6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [28]:
# Concat DFs
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [29]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [30]:
# One hot
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [31]:
# Join along cold
pd.concat([features,predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [32]:
# Creaty dummy variables
df_one['C1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: C1, dtype: object

In [33]:
# To do one hot encoding
pd.get_dummies(df_one['C1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

In [34]:
df = pd.read_csv('Universities.csv')

In [35]:
pwd

'/Users/phaseon/Documents/Development/DS'

In [36]:
# Output to CSV, with index
df.to_csv('output.csv', index=True)

In [37]:
pd.read_csv('output.csv')

,Unnamed: 0,Sector,University,Year,Completions,Geography
0,0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada
...,...,...,...,...,...,...
202,202,"Private for-profit, 2-year",Carrington College-Las Vegas,2012,120,Nevada
203,203,"Public, 4-year or above",Western Nevada College,2012,495,Nevada
204,204,"Private for-profit, 2-year",Nevada Career Institute,2012,101,Nevada
205,205,"Private not-for-profit, 2-year",Expertise Cosmetology Institute,2012,129,Nevada
206,206,"Public, 2-year",Truckee Meadows Community College,2012,1170,Nevada

In [38]:
!conda install lxml
!pip install lxml

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

Requirement already satisfied: lxml in /Users/phaseon/anaconda3/envs/tfcourse/lib/python3.7/site-packages (4.4.1)

In [39]:
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [40]:
import lxml

In [41]:
# Read html table
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [42]:
tables

[                               Bank Name        City  ST   CERT  \
 0       City National Bank of New Jersey      Newark  NJ  21111
 1                          Resolute Bank      Maumee  OH  58317
 2                  Louisa Community Bank      Louisa  KY  58112
 3                   The Enloe State Bank      Cooper  TX  10716
 4    Washington Federal Bank for Savings     Chicago  IL  30570
 ..                                   ...         ...  ..    ...
 554                   Superior Bank, FSB    Hinsdale  IL  32646
 555                  Malta National Bank       Malta  OH   6629
 556      First Alliance Bank & Trust Co.  Manchester  NH  34264
 557    National State Bank of Metropolis  Metropolis  IL   3815
 558                     Bank of Honolulu    Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                        Industrial Bank   November 1, 2019   November 7, 2019
 1                     Buckeye State Bank   October 25, 2019  November 12, 2019
 2      Kentucky Farmers Bank Corporation   October 25, 2019   November 7, 2019
 3                     Legend Bank, N. A.       May 31, 2019    August 22, 2019
 4                     Royal Savings Bank  December 15, 2017      July 24, 2019
 ..                                   ...                ...                ...
 554                Superior Federal, FSB      July 27, 2001    August 19, 2014
 555                    North Valley Bank        May 3, 2001  November 18, 2002
 556  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 557              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 558                   Bank of the Orient   October 13, 2000     March 17, 2005

 [559 rows x 7 columns]]